# StructuralSettings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSettings Properties
StructuralSettings Class See Also
---
The StructuralSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AssemblyInstanceId | The id of the assembly instance to which the element belongs.  (Inherited from Element.) |
| BoundaryConditionAreaAndLineSymbolSpacing | Symbol spacing for boundary conditions. |
| BoundaryConditionFamilySymbolFixed | The id of the FamilySymbol to represent a fixed boundary condition. |
| BoundaryConditionFamilySymbolPinned | The id of the FamilySymbol to represent a pinned boundary condition. |
| BoundaryConditionFamilySymbolRoller | The id of the FamilySymbol to represent a roller boundary condition. |
| BoundaryConditionFamilySymbolUserDefined | The id of the FamilySymbol to represent a user-defined boundary condition. |
| BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from Element.) |
| BraceAboveSymbol | The id of the ElementType to represent a brace above a beam in plan view. |
| BraceBelowSymbol | The id of the ElementType to represent a brace below a beam in plan view. |
| BraceParallelLineOffset | The distance by which brace symbols in plan views will be offset. |
| Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from Element.) |
| CreatedPhaseId | Id of a Phase at which the Element was created.  (Inherited from Element.) |
| DemolishedPhaseId | Id of a Phase at which the Element was demolished.  (Inherited from Element.) |
| DesignOption | Returns the design option to which the element belongs. (Inherited from Element.) |
| Document | Returns the Document in which the Element resides. (Inherited from Element.) |
| Geometry | Retrieves the geometric representation of the element. (Inherited from Element.) |
| GroupId | The id of the group to which an element belongs.  (Inherited from Element.) |
| Id | A unique identifier for an Element in an Autodesk Revit project.  (Inherited from Element.) |
| IsModifiable | Identifies if the element is modifiable.  (Inherited from Element.) |
| IsTransient | Indicates whether an element is transient or permanent.  (Inherited from Element.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Element.) |
| KickerBraceSymbol | The id of the ElementType to represent a kicker brace. |
| LevelId | The id of the level associated with the element.  (Inherited from Element.) |
| Location | This property is used to find the physical location of an element within a project. (Inherited from Element.) |
| Name | A human readable name for the Element. (Inherited from Element.) |
| OwnerViewId | The id of the view that owns the element.  (Inherited from Element.) |
| [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md "Parameter Property \(Guid\)") | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from Element.) |
| [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md "Parameter Property \(BuiltInParameter\)") | Retrieves a parameter from the element given a parameter id. (Inherited from Element.) |
| [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md "Parameter Property \(Definition\)") | Retrieves a parameter from the element based on its definition. (Inherited from Element.) |
| Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from Element.) |
| ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from Element.) |
| Pinned | Identifies if the element has been pinned to prevent changes.  (Inherited from Element.) |
| ShowBraceAbove | Whether to show brace symbols above beams in plan views. |
| ShowBraceBelow | Whether to show brace symbols below beams in plan views. |
| SymbolicCutbackForBeamAndTruss | Symbolic cutback distance to be applied to all beams and trusses. |
| SymbolicCutbackForBrace | Symbolic cutback distance to be applied to all braces. |
| SymbolicCutbackForColumn | Symbolic cutback distance to be applied to all columns. |
| UniqueId | A stable unique identifier for an element within the document.  (Inherited from Element.) |
| UseLoadsDisplayScaling | Whether to use loads display scaling. If disabled then loads are displayed according to force scale type parameters. |
| VersionGuid | Get the element version Guid.  (Inherited from Element.) |
| ViewSpecific | Identifies if the element is owned by a view.  (Inherited from Element.) |
| WorksetId | Get Id of the Workset which owns the element.  (Inherited from Element.) |

# See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace